In [50]:
import pandas as pd
import os

In [51]:
csv = os.path.join("Resources/Australia.csv")

In [52]:
pwd

'/Users/Justin/Documents/Bootcamp_Home folder/Project_1'

In [59]:
df = pd.read_csv(csv)

In [60]:
df.dropna(how='any')
df.dtypes

Country     object
Year         int64
Female     float64
Male       float64
Total      float64
dtype: object

In [61]:
df.head()

     Country  Year  Female   Male  Total
0  Australia  1921   63.18  59.10  60.97
1  Australia  1922   65.11  60.88  62.83
2  Australia  1923   63.66  59.98  61.68
3  Australia  1924   64.51  60.77  62.48
4  Australia  1925   65.38  61.30  63.17

In [78]:
df.count()

Country    100
Year       100
Female     100
Male       100
Total      100
dtype: int64

In [63]:
#Convert data types to relevant object
# df= df.astype{}, errors='raise'

In [92]:
life_df1 = df.loc[df["Year"] > 2007, ["Country", "Year", "Female", "Male", "Total"]]

In [93]:
life_df2 = life_df1.loc[life_df1["Year"] < 2019, ["Country", "Year", "Female", "Male", "Total"]]

In [94]:
life_df2.head(20)

      Country  Year  Female   Male  Total
87  Australia  2008   83.70  79.14  81.43
88  Australia  2009   84.00  79.44  81.73
89  Australia  2010   84.20  79.81  82.02
90  Australia  2011   84.25  79.92  82.09
91  Australia  2012   84.30  80.27  82.30
92  Australia  2013   84.62  80.47  82.55
93  Australia  2014   84.50  80.53  82.52
94  Australia  2015   84.62  80.57  82.60
95  Australia  2016   84.85  80.75  82.81
96  Australia  2017   84.75  80.69  82.72
97  Australia  2018   85.30  81.22  83.26